<?php
            $this->renderPartial('PartailMenu', array("username" => $username));
     
?>
<div class="panel panel-info">
    <div class="panel-heading">
        <h3 class="panel-title">เว็บฐานข้อมูลศิษย์เก่า</h3>
    </div>
    <div class="panel-body">
        <h3>ความเป็นมาและความสำคัญของปัญหา</h3>
        <p>&nbsp; &nbsp; &nbsp; &nbsp;เนื่องจากปัจจุบันสถาบันต่างๆมีนักเรียนนักศึกษาที่จบการศึกษาเป็นจำนวนมากซึ่งทางสถาบันมีความต้องการที่จะติดต่อกับนักศึกษาหรือนักศึกษาต้องการติดต่อกับเพื่อน รุ่นพี่และรุ่นน้องในสถาบันเดียวกัน ทางสถาบันจึงได้มีการสร้างเว็บไซต์ศิษย์เก่าขึ้นมา เพื่อเป็นช่องทางในการติดต่อสื่อสารและแลกเปลี่ยนข่าวสารต่างๆระหว่างนักศึกษากับทางสถาบันว่าปัจจุบันมีตำแหน่งงานที่ว่างอยู่และกำลังเปิดรับสมัครงานหรือรับสมัครนักศึกษาเพื่อเข้าศึกษาต่อในสถาบัน นอกจากนี้ยังเป็นการเปิดโอกาสให้รุ่นพี่รุ่นน้องได้แลกเปลี่ยนประสบการณ์ด้านการทำงานหรือคำแนะนำด้านต่างๆ สามารถพูดคุยผ่านทางเว็บไซต์ได้อย่างสะดวกยิ่งขึ้น</p>
        <p>&nbsp; &nbsp; &nbsp; &nbsp;แต่ในการสร้างเว็บไซต์ศิษย์เก่าจำเป็นต้องมีผู้เชี่ยวชาญที่มีความรู้ความสามารถในเรื่องของการเขียนเว็บไซต์ ไม่ว่าจะเป็นเรื่องของการเขียนโปรแกรมต่างๆ ที่เกี่ยวกับการสร้างเว็บไซต์ ซึ่งจะต้องมีการจ้างบุคคลที่มีความรู้ความสามารถมาสร้างเว็บไซต์ และมีการใช้งบประมาณในการสร้างเว็บไซต์ค่อนข้างสูง บางครั้งการว่าจ้างให้บุคคลอื่นทำแทน อาจทำให้เกิดปัญหากับรูปแบบชิ้นงานที่ออกมาแล้วไม่ตรงกับความต้องการ หรือไม่สามารถใช้งานได้ตามที่เราคาดหวัง ซึ่งก่อให้เกิดปัญหาการอื่นๆตามมา ถือเป็นการสิ้นเปลืองงบประมาณและเวลา หากต้องมีการจัดทำเว็บไซต์ใหม่อีกครั้ง</p>
        <p>&nbsp; &nbsp; &nbsp; &nbsp;ด้วยเหตุนี้ทางคณะผู้จัดทำจึงมีแนวคิดที่จะสร้างเว็บไซต์ต้นแบบฐานข้อมูลศิษย์เก่า เพื่อให้เป็นเว็บไซต์ต้นแบบ ทำให้การสร้างเว็บไซต์ศิษย์เก่าไม่จำเป็นต้องใช้ผู้ที่มีความรู้ความสามารถมาก หากแต่มีทักษะในการใช้งานคอมพิวเตอร์ก็สามารถสร้างเว็บศิษย์เก่าได้ โดยประหยัดทั้งในเรื่องของเวลา บุคลากร และงบประมาณแล้วยังได้เว็บไซต์ตามที่ต้องการอีกด้วย</p>
    </div>
</div>




